# Python Basics

## 1. Переменные и типы данных

Python динамически типизирован, значит переменную не нужно объявлять с типом заранее.

```python
x = 10          # int
name = "Андрей" # str
pi = 3.14       # float
is_active = True # bool
```

### Типы данных:

* `int` – целые числа
* `float` – числа с плавающей точкой
* `str` – строки
* `bool` – логические значения (`True` / `False`)
* `list` – список
* `tuple` – кортеж
* `dict` – словарь
* `set` – множество

### Проверка типа:

```python
print(type(x))  # <class 'int'>
```

---

## 2. Операторы

### Арифметические:

`+`, `-`, `*`, `/` (float), `//` (целое деление), `%` (остаток), `**` (степень)

### Сравнения:

`==`, `!=`, `>`, `<`, `>=`, `<=`

### Логические:

`and`, `or`, `not`

Пример:

```python
x = 5
y = 10
print(x < y and y > 0)  # True
```

---

## 3. Условные конструкции

```python
age = 20
if age >= 18:
    print("Взрослый")
elif age > 12:
    print("Подросток")
else:
    print("Ребенок")
```

> Обратите внимание на отступы – они критичны в Python!

---

## 4. Циклы

### `for`:

```python
for i in range(5):  # 0,1,2,3,4
    print(i)
```

### `while`:

```python
count = 0
while count < 5:
    print(count)
    count += 1
```

### Прерывание цикла

* `break` – выйти из цикла
* `continue` – пропустить итерацию

---

## 5. Функции

```python
def greet(name):
    return f"Привет, {name}!"

print(greet("Андрей"))
```

* `def` – создание функции
* Параметры могут иметь значения по умолчанию
* `return` возвращает результат, иначе функция вернёт `None`

---

## 6. Встроенные функции

* `print()` – вывод
* `len()` – длина
* `range()` – генерация последовательности
* `type()` – проверка типа
* `input()` – ввод с клавиатуры

Пример:

```python
name = input("Введите имя: ")
print(f"Привет, {name}, длина имени: {len(name)}")
```

---

## 7. Мини-задания

1. Создать переменные всех основных типов и вывести их типы.
2. Написать программу, которая проверяет число: положительное, отрицательное или ноль.
3. Создать функцию, которая возвращает квадрат числа.
4. С помощью цикла `for` вывести все числа от 1 до 10, кроме 5.

---

Конец файла `01_Basics.md`
